app/controllers/orders_controller.rb

  def create
  	@order = current_user.orders.create(order_params)
---
INSERT INTO "orders" ("quantity", "price", "service_id", "user_id", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantity", 1], ["price", 1000], ["service_id", 1], ["user_id", 1], ["total_price", 1000], ["created_at", "2017-02-13 09:11:43.498865"], ["updated_at", "2017-02-13 09:11:43.498865"]]

  def user_orders
    @orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]

  def set_service
    @service = Service.find(params[:service_id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ?  ORDER BY "services"."created_at" DESC LIMIT 1  [["id", 4]]