app/controllers/pages_controller.rb

  def home
  	@services = Service.limit(4)
---
SELECT  "services".* FROM "services"  ORDER BY "services"."created_at" DESC LIMIT 4