app/controllers/services_controller.rb

  def create
    @service = current_user.services.build(service_params)
    if @service.save
---
INSERT INTO "services" ("title", "requirements", "description", "price", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def set_service
    @service = Service.find(params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ?  ORDER BY "services"."created_at" DESC LIMIT 1  [["id", 4]]